### 1.Read the three files into python as dataframes
* Import 3 csv into data frame

In [3]:
import numpy as np
import pandas as pd

In [4]:
file1=pd.read_csv("/Users/macbook/Desktop/IRON  HÂCK/Day2_Pandas/file1.csv")
file2=pd.read_csv("/Users/macbook/Desktop/IRON  HÂCK/Day2_Pandas/file2.csv")
file3=pd.read_csv("/Users/macbook/Desktop/IRON  HÂCK/Day2_Pandas/file3.csv")

### 2. Show the DataFrame's shape.

In [5]:
file1.shape

(4008, 11)

In [6]:
file2.shape

(996, 11)

In [7]:
file3.shape

(7070, 11)

### 3.Standardize header names.
* Rename "st" in file 2 & file 1 to "state" 
* Change to lower case in all heading of 3 files

In [8]:
new_names={'st':'state'}

In [9]:
file1.rename(columns=new_names,inplace=True)

In [10]:
file2.rename(columns=new_names,inplace=True)

In [11]:
col1=[]
for i in range (len(file1.columns)):
    col1.append(file1.columns[i].lower())

In [12]:
file1.columns=col1
file1.columns

Index(['customer', 'st', 'gender', 'education', 'customer lifetime value',
       'income', 'monthly premium auto', 'number of open complaints',
       'policy type', 'vehicle class', 'total claim amount'],
      dtype='object')

In [13]:
col2=[]
for i in range (len(file2.columns)):
    col2.append(file2.columns[i].lower())

In [14]:
file2.columns=col2

In [15]:
file2.columns

Index(['customer', 'st', 'gender', 'education', 'customer lifetime value',
       'income', 'monthly premium auto', 'number of open complaints',
       'total claim amount', 'policy type', 'vehicle class'],
      dtype='object')

In [16]:
col3=[]
for i in range (len(file3.columns)):
    col3.append(file3.columns[i].lower())

In [17]:
file3.columns=col3

In [18]:
file3.columns

Index(['customer', 'state', 'customer lifetime value', 'education', 'gender',
       'income', 'monthly premium auto', 'number of open complaints',
       'policy type', 'total claim amount', 'vehicle class'],
      dtype='object')

### 4. Concatenate the three dataframes
Use pd.concat fuction, with <font color=red>axis = 0 to copy by row

In [19]:
lab2=pd.concat([file1,file2,file3], axis =0)

### pay attention to the Int64Index: because there ar 12074 entries, but only 7069 row

In [20]:
lab2.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 12074 entries, 0 to 7069
Data columns (total 12 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   customer                   9137 non-null   object
 1   st                         2067 non-null   object
 2   gender                     9015 non-null   object
 3   education                  9137 non-null   object
 4   customer lifetime value    9130 non-null   object
 5   income                     9137 non-null   float64
 6   monthly premium auto       9137 non-null   float64
 7   number of open complaints  9137 non-null   object
 8   policy type                9137 non-null   object
 9   vehicle class              9137 non-null   object
 10  total claim amount         9137 non-null   float64
 11  state                      7070 non-null   object
dtypes: float64(3), object(9)
memory usage: 1.2+ MB

In [21]:
lab2.tail(1)

,customer,st,gender,education,customer lifetime value,income,monthly premium auto,number of open complaints,policy type,vehicle class,total claim amount,state
7069,Y167826,NaN,M,College,2611.836866,0.0,77.0,0,Corporate Auto,Two-Door Car,369.6,California

In [22]:
# reset the index because it has been truncated in the concat() 
lab2.reset_index(drop=True, inplace=True)

In [23]:
lab2.tail(1)

,customer,st,gender,education,customer lifetime value,income,monthly premium auto,number of open complaints,policy type,vehicle class,total claim amount,state
12073,Y167826,NaN,M,College,2611.836866,0.0,77.0,0,Corporate Auto,Two-Door Car,369.6,California

### 5. Which columns are numerical?

In [24]:
lab2.dtypes

customer                      object
st                            object
gender                        object
education                     object
customer lifetime value       object
income                       float64
monthly premium auto         float64
number of open complaints     object
policy type                   object
vehicle class                 object
total claim amount           float64
state                         object
dtype: object

In [25]:
numerical= lab2.select_dtypes([np.number]).columns
numerical

Index(['income', 'monthly premium auto', 'total claim amount'], dtype='object')

### 6. Which columns are categorical?

In [26]:
lab2.columns

Index(['customer', 'st', 'gender', 'education', 'customer lifetime value',
       'income', 'monthly premium auto', 'number of open complaints',
       'policy type', 'vehicle class', 'total claim amount', 'state'],
      dtype='object')

In [27]:
categorical=lab2.select_dtypes(['object']).columns
categorical

Index(['customer', 'st', 'gender', 'education', 'customer lifetime value',
       'number of open complaints', 'policy type', 'vehicle class', 'state'],
      dtype='object')

### 7. Perform the data cleaning operations mentioned so far in class

#### a. Delete the column education and the number of open complaints from the dataframe.

In [28]:
lab2.pop('education')

0                      Master
1                    Bachelor
2                    Bachelor
3                    Bachelor
4        High School or Below
                 ...
12069                Bachelor
12070                 College
12071                Bachelor
12072                 College
12073                 College
Name: education, Length: 12074, dtype: object

In [29]:
lab2.pop('number of open complaints')

0        1/0/00
1        1/0/00
2        1/0/00
3        1/0/00
4        1/0/00
          ...
12069         0
12070         0
12071         3
12072         0
12073         0
Name: number of open complaints, Length: 12074, dtype: object

In [30]:
lab2.head()

,customer,st,gender,customer lifetime value,income,monthly premium auto,policy type,vehicle class,total claim amount,state
0,RB50392,Washington,NaN,NaN,0.0,1000.0,Personal Auto,Four-Door Car,2.704934,NaN
1,QZ44356,Arizona,F,697953.59%,0.0,94.0,Personal Auto,Four-Door Car,1131.464935,NaN
2,AI49188,Nevada,F,1288743.17%,48767.0,108.0,Personal Auto,Two-Door Car,566.472247,NaN
3,WW63253,California,M,764586.18%,0.0,106.0,Corporate Auto,SUV,529.881344,NaN
4,GA49547,Washington,M,536307.65%,36357.0,68.0,Personal Auto,Four-Door Car,17.269323,NaN

#### b. Correct the values in the column customer lifetime value. They are given as a percent, so multiply them by 100 and change dtype to numerical type.

In [31]:
lab2.tail()

,customer,st,gender,customer lifetime value,income,monthly premium auto,policy type,vehicle class,total claim amount,state
12069,LA72316,NaN,M,23405.98798,71941.0,73.0,Personal Auto,Four-Door Car,198.234764,California
12070,PK87824,NaN,F,3096.511217,21604.0,79.0,Corporate Auto,Four-Door Car,379.200000,California
12071,TD14365,NaN,M,8163.890428,0.0,85.0,Corporate Auto,Four-Door Car,790.784983,California
12072,UP19263,NaN,M,7524.442436,21941.0,96.0,Personal Auto,Four-Door Car,691.200000,California
12073,Y167826,NaN,M,2611.836866,0.0,77.0,Corporate Auto,Two-Door Car,369.600000,California

In [32]:
lab2['customer lifetime value']=pd.to_numeric(lab2['customer lifetime value'],errors='coerce')

In [33]:
lab2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12074 entries, 0 to 12073
Data columns (total 10 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   customer                 9137 non-null   object
 1   st                       2067 non-null   object
 2   gender                   9015 non-null   object
 3   customer lifetime value  7070 non-null   float64
 4   income                   9137 non-null   float64
 5   monthly premium auto     9137 non-null   float64
 6   policy type              9137 non-null   object
 7   vehicle class            9137 non-null   object
 8   total claim amount       9137 non-null   float64
 9   state                    7070 non-null   object
dtypes: float64(4), object(6)
memory usage: 943.4+ KB

In [34]:
lab2['customer lifetime value']=(lab2['customer lifetime value']*100).round(2)

In [35]:
lab2.tail()

,customer,st,gender,customer lifetime value,income,monthly premium auto,policy type,vehicle class,total claim amount,state
12069,LA72316,NaN,M,2340598.80,71941.0,73.0,Personal Auto,Four-Door Car,198.234764,California
12070,PK87824,NaN,F,309651.12,21604.0,79.0,Corporate Auto,Four-Door Car,379.200000,California
12071,TD14365,NaN,M,816389.04,0.0,85.0,Corporate Auto,Four-Door Car,790.784983,California
12072,UP19263,NaN,M,752444.24,21941.0,96.0,Personal Auto,Four-Door Car,691.200000,California
12073,Y167826,NaN,M,261183.69,0.0,77.0,Corporate Auto,Two-Door Car,369.600000,California

#### c. Check for duplicate rows in the data and remove if any.

In [36]:
lab2.shape

(12074, 10)

In [37]:
lab2_dup = lab2[lab2.duplicated()]
print(lab2_dup)

     customer          st gender  customer lifetime value   income  \
1072      NaN         NaN    NaN                      NaN      NaN
1073      NaN         NaN    NaN                      NaN      NaN
1074      NaN         NaN    NaN                      NaN      NaN
1075      NaN         NaN    NaN                      NaN      NaN
1076      NaN         NaN    NaN                      NaN      NaN
...       ...         ...    ...                      ...      ...
4006      NaN         NaN    NaN                      NaN      NaN
4007      NaN         NaN    NaN                      NaN      NaN
4008  GS98873     Arizona      F                      NaN  16061.0
4009  CW49887  California      F                      NaN  79487.0
4010  MY31220  California      F                      NaN  54230.0

      monthly premium auto    policy type  vehicle class  total claim amount  \
1072                   NaN            NaN            NaN                 NaN
1073                   NaN            NaN            NaN                 NaN
1074                   NaN            NaN            NaN                 NaN
1075                   NaN            NaN            NaN                 NaN
1076                   NaN            NaN            NaN                 NaN
...                    ...            ...            ...                 ...
4006                   NaN            NaN            NaN                 NaN
4007                   NaN            NaN            NaN                 NaN
4008                  88.0  Personal Auto  Four-Door Car               633.6
4009                 114.0   Special Auto            SUV               547.2
4010                 112.0  Personal Auto   Two-Door Car               537.6

     state
1072   NaN
1073   NaN
1074   NaN
1075   NaN
1076   NaN
...    ...
4006   NaN
4007   NaN
4008   NaN
4009   NaN
4010   NaN

[2939 rows x 10 columns]

In [38]:
lab2_dup=lab2.drop_duplicates()

In [39]:
lab2_dup.shape

(9135, 10)

#### d.Filter out the data for customers who have an income of 0 or less.

In [40]:
lab2.query('income <=0')

,customer,st,gender,customer lifetime value,income,monthly premium auto,policy type,vehicle class,total claim amount,state
0,RB50392,Washington,NaN,NaN,0.0,1000.0,Personal Auto,Four-Door Car,2.704934,NaN
1,QZ44356,Arizona,F,NaN,0.0,94.0,Personal Auto,Four-Door Car,1131.464935,NaN
3,WW63253,California,M,NaN,0.0,106.0,Corporate Auto,SUV,529.881344,NaN
7,CF85061,Arizona,M,NaN,0.0,101.0,Corporate Auto,Four-Door Car,363.029680,NaN
10,SX51350,California,M,NaN,0.0,67.0,Personal Auto,Four-Door Car,482.400000,NaN
...,...,...,...,...,...,...,...,...,...,...
12063,WZ45103,NaN,F,567805.02,0.0,76.0,Personal Auto,Four-Door Car,364.800000,California
12065,RX91025,NaN,M,1987226.20,0.0,185.0,Personal Auto,SUV,1950.725547,California
12066,AC13887,NaN,M,462899.53,0.0,67.0,Corporate Auto,Two-Door Car,482.400000,California
12071,TD14365,NaN,M,816389.04,0.0,85.0,Corporate Auto,Four-Door Car,790.784983,California
12073,Y167826,NaN,M,261183.69,0.0,77.0,Corporate Auto,Two-Door Car,369.600000,California